## Plan Result (aat_pubsubappgateway - TerraformPlanApply)




<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.pubsubappgateway[0].azurerm_application_gateway.ag[0]
  * module.pubsubappgateway[0].azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.pubsubappgateway[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
  * module.pubsubappgateway[0].azurerm_public_ip.app_gw[0]
  * module.pubsubappgateway[0].azurerm_web_application_firewall_policy.waf_policy[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.pubsubappgateway[0].azurerm_application_gateway.ag[0] will be created
  + resource "azurerm_application_gateway" "ag" {
      + firewall_policy_id          = (known after apply)
      + id                          = (known after apply)
      + location                    = "uksouth"
      + name                        = "cft-fe-00-aat-agw-pubsub"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "cft-aat-network-rg"
      + tags                        = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
      + zones                       = [
          + "1",
          + "2",
          + "3",
        ]

      + autoscale_configuration {
          + max_capacity = 10
          + min_capacity = 2
        }

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.164.50",
            ]
          + name         = "em-icp-webpubsub"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "em-icp-webpubsub"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "em-icp-webpubsub"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
            # (3 unchanged attributes hidden)
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "appGwPublicFrontendIp"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }
      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "appGwPrivateFrontendIp"
          + private_ip_address            = "10.10.169.8"
          + private_ip_address_allocation = "Static"
          + private_link_configuration_id = (known after apply)
          + subnet_id                     = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/infra-appgws"
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "http"
          + port = 80
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "gateway"
          + subnet_id = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/infra-appgws"
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "http"
          + host_name                      = "em-icp-webpubsub.aat.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "em-icp-webpubsub"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
            # (3 unchanged attributes hidden)
        }

      + probe {
          + host                                      = "em-icp-webpubsub.aat.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 20
          + minimum_servers                           = 0
          + name                                      = "em-icp-webpubsub"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }

      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "em-icp-webpubsub"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "em-icp-webpubsub"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "em-icp-webpubsub"
          + id                          = (known after apply)
          + name                        = "em-icp-webpubsub"
          + priority                    = 10
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }

      + rewrite_rule_set {
          + id   = (known after apply)
          + name = "x_fwded_proto"

          + rewrite_rule {
              + name          = "x_fwded_proto"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-Proto"
                  + header_value = "https"
                }
              + request_header_configuration {
                  + header_name  = "X-Forwarded-Port"
                  + header_value = "443"
                }
              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_add_x_forwarded_for_proxy}"
                }
            }
        }

      + sku {
          + name = "WAF_v2"
          + tier = "WAF_v2"
        }

      + ssl_policy (known after apply)
    }

  # module.pubsubappgateway[0].azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "app-gw"
      + target_resource_id             = (known after apply)

      + enabled_log (known after apply)

      + log (known after apply)

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.pubsubappgateway[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + name                           = "app-gw-storage-account"
      + storage_account_id             = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Storage/storageAccounts/hmctscftdiagaat"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "ApplicationGatewayAccessLog"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "ApplicationGatewayPerformanceLog"
            # (1 unchanged attribute hidden)
        }

      + log (known after apply)
    }

  # module.pubsubappgateway[0].azurerm_public_ip.app_gw[0] will be created
  + resource "azurerm_public_ip" "app_gw" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "cft-pubsub-fe-appgw-aat-pip"
      + resource_group_name     = "cft-aat-network-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
      + zones                   = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.pubsubappgateway[0].azurerm_web_application_firewall_policy.waf_policy[0] will be created
  + resource "azurerm_web_application_firewall_policy" "waf_policy" {
      + http_listener_ids   = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "pubsub-waf-policy-aat"
      + path_based_rule_ids = (known after apply)
      + resource_group_name = "cft-aat-network-rg"
      + tags                = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }

      + managed_rules {
          + managed_rule_set {
              + type    = "OWASP"
              + version = "3.2"

              + rule_group_override {
                  + disabled_rules  = (known after apply)
                  + rule_group_name = "REQUEST-920-PROTOCOL-ENFORCEMENT"

                  + rule {
                      + action  = "Log"
                      + enabled = true
                      + id      = "920300"
                    }
                  + rule {
                      + action  = "Block"
                      + enabled = true
                      + id      = "920440"
                    }
                }
            }
        }

      + policy_settings {
          + enabled                          = true
          + file_upload_limit_in_mb          = 100
          + max_request_body_size_in_kb      = 128
          + mode                             = "Prevention"
          + request_body_check               = true
          + request_body_inspect_limit_in_kb = 128
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label aat_pubsubappgateway - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/azure-platform-terraform/issues/2365/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":2365,"Program":"tfcmt","SHA1":"","Target":"aat_pubsubappgateway - TerraformPlanApply","Vars":{}} -->